Revit 2027 API
MEPAnalyticalNode.IsFocalNode Property
 Is this node a focal point of multiple branches?
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFocalNode { get; }
Public ReadOnly Property IsFocalNode As Boolean
	Get
public:
property bool IsFocalNode {
	bool get ();
}
member IsFocalNode : bool with get
Property Value
Boolean
See Also
Reference
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace